[
  {
    "code": "EPAF",
    "role": "성기사(Paladin)",
    "pros": "당신의 가장 큰 강점은 뛰어난 대외 활동 능력과 성장 지원에 있습니다. 팀 내부에서는 긍정적인 에너지를 불어넣어 협력적인 분위기를 조성하며, 팀원 개개인의 잠재력을 발견하고 키워주는 데 집중합니다. 또한, 외부 관계를 처리하고 팀을 대변하는 발표나 협상에 매우 능숙하여 팀의 이미지를 긍정적으로 만들고 든든하게 지켜줍니다. 팀의 안정감은 바로 당신에게서 시작됩니다.",
    "cons": "모두를 만족시키려는 선량한 마음이 때로는 약점으로 작용할 수 있습니다. 타인의 의견을 너무나 중요하게 생각하는 나머지, 결정을 내릴 때 우유부단한 모습을 보이거나 결정을 미루는 경향이 있습니다. 특히, 팀원들의 상반된 의견 사이에서 지나치게 휘둘릴 위험이 있습니다. 진정한 리더십은 모두를 만족시키는 것이 아니라, 때로는 최선의 선택을 위해 단호하게 나아가는 용기임을 기억해야 합니다. 당신의 결정력을 강화하는 것이 성기사로서의 성숙함을 완성하는 열쇠입니다.",
    "tags": "#동기부여 #성장지원 #우유부단 #리더십",
    "good_match": "ISCR",
    "bad_match": "ISCF",
    "neutral_match": "EPCR,IPCF",
    "summary_fantasy": "모두를 감싸 안는 빛의 수호자!",
    "summary_team": "팀을 하나로 모아주는 안정감의 리더."
  },
  {
    "code": "EPAR",
    "role": "도적 (Rogue/Thief)",
    "pros": "당신은 강력한 리더 중 한 명으로, 뛰어난 아이디어와 넘치는 에너지로 상황을 뒤집는 승부사입니다. 당신의 자유로운 생각과 즉각적인 행동력은 경직된 팀에 신선한 바람을 불어넣으며, 특히 프로젝트 초반의 브레인스토밍이나 창의력이 필요한 순간에 빛을 발합니다.",
    "cons": "당신의 산만함과 즉흥성은 종종 리스크가 될 수 있습니다. 내부 고민 때문에 감정의 기복이 심해져 팀의 흥이 다소 떨어지게 할 수 있으며, 때로는 너무 중요한 이슈를 무시하고 지나쳐 나중에 계획을 수습해야 하는 상황이 발생할 수 있습니다. 발산된 에너지를 한 곳에 집중하고, 중요한 사안을 놓치지 않도록 동료의 조언을 귀담아듣는 것이 중요합니다.",
    "tags": "#자유로운발상 #에너자이저 #즉흥적 #산만함",
    "good_match": "ISCF",
    "bad_match": "ISCR",
    "neutral_match": "ISAR,EPAR",
    "summary_fantasy": "예측할 수 없는 장난꾸러기!",
    "summary_team": "뜻밖의 아이디어로 흐름을 뒤집는 분위기 메이커."
  },
  {
    "code": "EPCF",
    "role": "전사 (Warrior)",
    "pros": "당신은 강력한 리더십과 추진력을 바탕으로 목표를 향한 선봉장 역할을 수행하며, 빠르게 목표를 돌파하고, 팀의 나태함을 허용하지 않습니다. 결과 중심으로 팀을 이끌어 목표 달성 능력이 뛰어납니다.",
    "cons": "당신의 방식이 지나치게 강압적이어서 팀원들에게 숨 막히는 환경을 만들 수 있습니다. 강력한 실력과 주도적인 태도는 좋지만, 타인의 의견을 무시하고 자신의 방식을 강요하는 모습은 팀의 사기를 저하시킬 수 있습니다. 유연한 자세로 소통을 강화하고, 팀원의 성장을 지원하는 멘토의 역할도 함께 고민할 필요가 있습니다.",
    "tags": "#리더십 #추진력 #결과중심 #꼰대",
    "good_match": "ISAR",
    "bad_match": "ISAF",
    "neutral_match": "IPAF,IPCF",
    "summary_fantasy": "전장을 지휘하는 냉철한 지배자!",
    "summary_team": "목표를 향해 돌파하는 강한 추진력의 선봉장."
  },
  {
    "code": "EPCR",
    "role": "닌자 (Ninja)",
    "pros": "강한 실력과 주도적인 태도는 위기 상황에서 특히 빛을 발하며, 특히 당신의 임기응변 능력은 난관을 돌파하는 핵심 무기입니다. 정해진 틀을 깨고 새로운 길을 모색하며, 뛰어난 언변과 논리로 사람들을 매료시키는 능력이 뛰어납니다.",
    "cons": "변덕이 심해 계획을 자주 변경하여 팀원들을 혼란스럽게 할 수 있습니다. 또한, 지루한 마무리 작업을 회피하고, 때로는 불필요한 논쟁(다툼)을 유발할 수 있습니다. 뛰어난 아이디어를 구체적인 실행 계획으로 마무리할 수 있도록 끈기를 키워야 합니다.",
    "tags": "#창의적 #임기응변 #변덕 #쌈닭",
    "good_match": "ISAF",
    "bad_match": "ISAR",
    "neutral_match": "IPAR,EPAF",
    "summary_fantasy": "혼란 속에서 해답을 찾는 전략가",
    "summary_team": "정해진 틀을 깨고 새로운 길을 찾는 전략가."
  },
  {
    "code": "ESAF",
    "role": "사냥꾼 (Hunter)",
    "pros": "뛰어난 친화력과 소통 능력으로 팀원들의 심리적 유대를 강화하고, 팀 외부와의 관계를 원만하게 이끌어내는 데 능숙합니다.",
    "cons": "지나친 조화 중시는 스스로의 의견을 말하지 못하게 만들 수 있습니다. 또한, 개인적인 비난이나 비판에 쉽게 상처받기 쉽습니다. 때로는 팀의 발전을 위해 불편한 진실을 말할 용기와, 타인의 비판을 건설적으로 수용할 수 있는 정신적인 강인함을 키워야 합니다.",
    "tags": "#팀워크 #협력 #사기진작 #유리멘탈",
    "good_match": "IPCR",
    "bad_match": "IPCF",
    "neutral_match": "ESCR,ISAR",
    "summary_fantasy": "팀을 하나로 묶는 따뜻한 길잡이!",
    "summary_team": "팀의 분위기와 관계를 부드럽게 조율하는 서포터."
  },
  {
    "code": "ESAR",
    "role": "창술사 (Dragoon)",
    "pros": "활발한 소통과 밝은 에너지로 팀의 분위기를 띄우고, 유쾌한 임기응변으로 따분한 작업 중에도 팀원들을 즐겁게 합니다. 타고난 카리스마는 즉각적인 매력을 발산하여, 일상적인 회의를 활력 넘치는 브레인스토밍 세션으로 바꿉니다.",
    "cons": "지루하고 반복적인 작업을 힘들어하고, 재미를 우선시하여 프로젝트의 책임감 있는 마무리에 소홀해질 위험이 있습니다. 즐거움을 추구하다가 미래의 도전을 예측하지 못하는 경우가 많으므로, 세부적인 장기 계획을 세우는 능력을 익혀야 합니다.",
    "tags": "#활력 #즐거움 #즉각적 #용두사미",
    "good_match": "IPCF",
    "bad_match": "IPCR",
    "neutral_match": "ISAR,ISCR",
    "summary_fantasy": "전장을 가르는 찬란한 선봉장!",
    "summary_team": "순간의 한 방으로 팀 분위기를 끌어올리는 핵심 딜러."
  },
  {
    "code": "ESCF",
    "role": "저격수 (Sniper)",
    "pros": "계획과 규율을 바탕으로 팀의 안정적인 관리를 책임지는 사람입니다. 모든 일의 기본을 확실하게 지키고 효율을 최우선으로 생각합니다. 프로세스에 대한 엄격한 준수는 오류를 최소화하고 최종 결과물이 일관되게 높은 품질을 유지하도록 보장합니다.",
    "cons": "변화나 새로운 시도에 대한 유연성이 부족하며, 지나친 규율 강조는 팀의 분위기를 경직시키고 꼰대라는 비판을 받을 수 있습니다. 검증된 방법을 고수하려는 저항은 혁신을 저해할 수 있으므로, 계산된 위험을 환영하는 환경을 조성해야 합니다.",
    "tags": "#효율적 #관리 #규율 #꼰대",
    "good_match": "IPAR",
    "bad_match": "IPAF",
    "neutral_match": "ISCF,ISAF",
    "summary_fantasy": "승리를 꿰뚫는 전장의 지휘자!",
    "summary_team": "낭비 없이 일을 정확히 마무리하는 실행가."
  },
  {
    "code": "ESCR",
    "role": "격투가 (Monk)",
    "pros": "현실적인 감각과 뛰어난 순발력을 바탕으로, 복잡한 고민 없이 즉시 행동으로 옮기는 행동대장입니다. 상황을 빠르게 파악하고 필요한 조치를 취합니다. 불필요한 이론을 제거하고, 오직 실용성과 빠른 결과 도출에만 집중하는 실용주의자입니다.",
    "cons": "지나치게 충동적인 행동으로 인해 계획이나 데이터를 무시하고 주관적으로 일을 진행하려는 경향이 있습니다. 포괄적인 데이터 분석보다는 본능에 의존하기 때문에, 때로는 시스템적인 위험이나 중요한 배경 정보를 간과할 수 있습니다.",
    "tags": "#순발력 #현실적 #행동대장 #충동적",
    "good_match": "IPAF",
    "bad_match": "IPAR",
    "neutral_match": "ESAF,ESCR",
    "summary_fantasy": "눈부신 센스로 문제를 돌파하는 해결사!",
    "summary_team": "빠른 판단과 행동으로 답답함을 뚫는 해결사."
  },
  {
    "code": "IPAF",
    "role": "점성술사 (Astrologian)",
    "pros": "팀의 갈등을 잠재우는 신중한 중재자입니다. 뛰어난 심리 파악 능력으로 미묘한 갈등을 감지하고, 분열된 의견을 하나로 모읍니다. 이들의 차분한 태도와 깊은 공감 능력은 복잡한 대인 관계를 헤쳐나가고 팀의 정서적 안정성을 회복시키는 데 탁월합니다.",
    "cons": "타인의 감정 노동을 중재하는 과정에서 에너지를 과도하게 소모하여 번아웃에 쉽게 노출될 수 있습니다. 자신의 한계를 인지하고 감정 노동을 위임하거나, 필요한 경계를 설정하여 소진을 막는 법을 배워야 합니다.",
    "tags": "#중재자 #심리파악 #신중함 #번아웃",
    "good_match": "ESCR",
    "bad_match": "ESCF",
    "neutral_match": "EPCF,IPAF",
    "summary_fantasy": "운명을 읽고 흐름을 조율하는 신비한 예언자!",
    "summary_team": "보이지 않는 흐름을 읽고 팀의 균형을 맞추는 조율자."
  },
  {
    "code": "IPAR",
    "role": "힐러 (Healer)",
    "pros": "깊은 통찰력을 바탕으로 현실을 넘어선 이상적인 비전을 제시하는 창조자입니다. 당신의 독창적인 창의성은 팀에 혁신적인 아이디어를 불어넣습니다. 이들은 추상적 사고의 달인으로, 서로 다른 아이디어를 종합하여 팀을 위한 응집력 있는 획기적인 비전을 만들 수 있습니다.",
    "cons": "지나치게 이상적인 목표를 추구하여 현실성이 부족하고, 외부의 날카로운 비판에 쉽게 상처받는 유리멘탈 성향이 있습니다. 자신의 원대한 개념을 실행 가능한 단계로 변환하는 데 어려움을 겪으므로, 구조와 현실 점검을 제공할 파트너가 필요합니다.",
    "tags": "#통찰력 #이상주의 #창의성 #유리멘탈",
    "good_match": "ESCF",
    "bad_match": "ESCR",
    "neutral_match": "IPAR,ISAF",
    "summary_fantasy": "순수한 신념으로 다른 이를 도와주는 마음의 치유자!",
    "summary_team": "팀의 사기를 북돋아주는 마음의 치유자"
  },
  {
    "code": "IPCF",
    "role": "흑마법사 (Black Mage)",
    "pros": "정확한 계산과 분석적인 사고를 통해, 가장 효율적이고 논리적인 전략을 도출해내는 냉정한 전략가입니다. 강한 실력과 데이터 기반의 판단력으로 팀의 방향을 제시하는 데 뛰어납니다. 순전히 객관적이고 시스템 기반의 접근 방식은 복잡한 구조적 비효율성을 진단하고 해결하는 데 매우 유용합니다.",
    "cons": "비판적 시각이 강하여 타인의 감정적 요소에 공감하지 못하고, 때로는 냉소적인 태도로 팀의 분위기를 해칠 수 있습니다. 논리에 지나치게 의존하면 차갑게 보일 수 있으므로, 팀원들의 사기를 유지하기 위해 그들의 정서적 기여를 의식적으로 인정해야 합니다.",
    "tags": "#전략가 #분석적 #비판적 #효율적",
    "good_match": "ESAR",
    "bad_match": "ESAF",
    "neutral_match": "ISCR,EPAF",
    "summary_fantasy": "한 발 앞선 계산으로 폭발적 마력을 뿜는 마법사!",
    "summary_team": "정확한 계산으로 가장 효율적인 길을 설계하는 전략가."
  },
  {
    "code": "IPCR",
    "role": "학자 (Scholar)",
    "pros": "명확한 시스템과 데이터를 통해 문제를 논리적으로 해결하는 해결사이자 분석가입니다. 복잡한 문제도 분석적으로 접근하여 해답을 찾아내는 데 뛰어난 재능을 보입니다. 이들은 비판에 견딜 수 있는 강력한 지적 틀을 구축하여 팀의 기반을 논리적으로 확실하게 만듭니다.",
    "cons": "완벽한 분석을 추구하느라 실행력 부족을 보이며, 새로운 아이디어에 대한 도파민 중독처럼 기존의 계획을 무시하고 다른 일에 몰두하는 경향이 있습니다. '완벽한 해답'을 끊임없이 추구하는 것은 행동을 지연시키므로, 모든 새로운 개념을 쫓는 성향을 관리해야 합니다.",
    "tags": "#논리적 #분석적 #실행력부족 #도파민중독",
    "good_match": "ESAF",
    "bad_match": "ESAR",
    "neutral_match": "EPAR,EPCR",
    "summary_fantasy": "지식과 분석으로 상황을 바꾸는 전략가!",
    "summary_team": "복잡한 문제를 논리로 풀어내는 숨은 해결사."
  },
  {
    "code": "ISAF",
    "role": "소환사 (Summoner)",
    "pros": "팀의 눈에 띄지 않는 곳에서 묵묵히 팀원들을 지원하고 정리하며, 뛰어난 배려심으로 팀의 안정감을 유지하는 데 중요한 역할을 합니다. 따뜻한 마음으로 동료들을 돌봅니다. 이들은 행정 업무와 물류 지원에 능숙하여, 다른 사람들이 빛날 수 있는 보이지 않는 기반을 제공합니다.",
    "cons": "지나친 갈등 회피 성향으로 인해 불편한 논의가 필요할 때 주저하고 중요한 이슈를 외면합니다. 대립을 피하는 것은 적절한 시기에 해결될 수 있는 문제를 악화시키므로, 정면으로 맞서서 해결할 수 있는 자기주장 능력을 길러야 합니다.",
    "tags": "#지원 #정리 #배려 #갈등회피",
    "good_match": "EPCR",
    "bad_match": "EPCF",
    "neutral_match": "IPAR,ESAF",
    "summary_fantasy": "섬세한 손길로 마법을 부리는 조용한 지원가!",
    "summary_team": "보이지 않는 곳에서 팀을 받쳐주는 든든한 지원자."
  },
  {
    "code": "ISAR",
    "role": "무도가 (Dancer)",
    "pros": "미적 감각이 뛰어나 뛰어난 디자인과 창의적인 결과물을 만드는 데 능숙합니다. 일에 대한 높은 몰입을 보이며, 특유의 분위기 메이커 역할로 팀의 활력을 책임집니다. 이들은 프로젝트의 시각적, 경험적 측면을 쉽게 관리하여 기억에 남고 매력적인 결과물을 만들어냅니다.",
    "cons": "이상주의적 성향과 유연한 자세를 취하다 보니, 중요한 순간에 우유부단한 모습을 보이거나 결정을 미루는 경향이 있습니다. '최고'의 결과를 원하는 욕구가 여러 좋은 선택지 사이에서 결정을 마비시킬 수 있으므로, 명확한 결정 마감 시간이 필요합니다.",
    "tags": "#몰입 #미적감각 #분위기메이커 #우유부단",
    "good_match": "EPCF",
    "bad_match": "EPCR",
    "neutral_match": "ESAR,ISAR",
    "summary_fantasy": "예술과 전투를 춤으로 승화하는 감각의 무예가!",
    "summary_team": "팀 전체의 흐름을 부드럽게 만드는 감각적 완충자."
  },
  {
    "code": "ISCF",
    "role": "기사(Knight)",
    "pros": "계획적이고 책임감이 매우 강하여, 팀의 안정적인 운영에 기여하는 핵심 인물입니다. 팀이 굴러가는 데 필요한 모든 구조를 설계하고 관리합니다. 이들은 팀의 기반이 되는 존재로, 안정성을 제공하고 모든 단계가 계산되도록 보장하여 예기치 않은 재앙으로부터 프로젝트를 보호합니다.",
    "cons": "고집불통 성향이 강해 자신의 방식이나 계획이 변경되는 것을 극도로 꺼려하며, 새로운 아이디어를 거부하는 모습으로 비칠 수 있습니다. 과거의 성공적인 모델에 대한 극도의 집착은 새로운 기술이나 방법론에 내재된 기회를 놓치게 할 수 있습니다.",
    "tags": "#계획적 #책임감 #안정성 #고집불통",
    "good_match": "EPAR",
    "bad_match": "EPAF",
    "neutral_match": "ESCF,ESAF",
    "summary_fantasy": "흔들림 없는 철벽 방어자!",
    "summary_team": "묵묵히 다른 이를 도와주는 안정적인 팀의 기둥"
  },
  {
    "code": "ISCR",
    "role": "사무라이 (Samurai)",
    "pros": "실용적인 결과를 최우선으로 생각하며, 뛰어난 위기 대처 능력으로 복잡한 상황을 냉철하게 해결합니다. 감정적인 요소에 휘둘리지 않고 오직 결과만을 바라보며 나아갑니다. 이들은 위기 시 즉각적이고 어려운 결정을 내리는 데 독보적이며, 즉각적인 승리나 안전을 위한 가장 실용적인 경로를 우선시합니다.",
    "cons": "지나친 이기주의와 독선적인 태도는 팀워크를 해치는 주요 원인입니다. 개인적인 성공에 대한 끈임 없는 집착은 팀의 신뢰를 무너뜨릴 수 있으므로, 공유된 목표와 투명한 협업에 의식적으로 전념해야 합니다.",
    "tags": "#실용적 #위기대처 #이기주의 #독선적",
    "good_match": "EPAF",
    "bad_match": "EPAR",
    "neutral_match": "ESCR,IPCF",
    "summary_fantasy": "문제를 단번에 베어내는 날카로운 검술가!",
    "summary_team": "말보다 실력으로 증명하는 냉철한 해결사."
  }
]